# pandas를 사용하여 데이터 다루기

### pandas 모듈 불러오기

In [1]:
import pandas as pd

### csv파일 읽기  
데이터로 국가 통계 포털의 인구총조사를 사용했다.

In [2]:
# pd.read_csv("파일경로")
population=pd.read_csv("data/인구총조사.csv",encoding='cp949')

※데이터에 한글이 들어가있을 경우 인코딩에 신경써야함

### 데이터 알아보기

In [3]:
population.head()

  행정구역별(읍면동)      2017      2018      2019      2020      2021
0         전국  51422507  51629512  51779203  51829136  51738071
1         읍부   4794377   4984023   5057507   5113052   5183834
2         면부   4835090   4730290   4698591   4650781   4534456
3         동부  41793040  41915199  42023105  42065303  42019781
4      서울특별시   9741871   9673936   9639541   9586195   9472127

head()는 첫 5의 행을 보여주는 메서드다.

In [4]:
population.columns

Index(['행정구역별(읍면동)', '2017', '2018', '2019', '2020', '2021'], dtype='object')

columns를 사용하면 column의 title에 해당하는 값들을 반환한다

In [5]:
population.columns[0]

'행정구역별(읍면동)'

'행정구역별(읍면동)'만 따로 '지역'이라는 이름으로 변경을 원하면 아래와 같이 코드를 작성할 수 있다.  
(inplace option을 True로 지정하면 원본데이터에도 설정값을 저장할 수 있게된다.)

In [6]:
population.rename(columns={population.columns[0]:'지역'},inplace=True)
population.columns

Index(['지역', '2017', '2018', '2019', '2020', '2021'], dtype='object')

In [7]:
population.describe()

               2017          2018          2019          2020          2021
count  2.100000e+01  2.100000e+01  2.100000e+01  2.100000e+01  2.100000e+01
mean   7.346072e+06  7.375645e+06  7.397029e+06  7.404162e+06  7.391153e+06
std    1.347450e+07  1.352709e+07  1.356898e+07  1.358854e+07  1.357286e+07
min    2.765890e+05  3.123740e+05  3.381360e+05  3.539330e+05  3.662270e+05
25%    1.525849e+06  1.520391e+06  1.520127e+06  1.521763e+06  1.521890e+06
50%    2.453041e+06  2.444412e+06  2.429940e+06  2.410700e+06  2.387911e+06
75%    4.794377e+06  4.730290e+06  4.698591e+06  4.650781e+06  4.534456e+06
max    5.142251e+07  5.162951e+07  5.177920e+07  5.182914e+07  5.173807e+07

describe()로 통계량을 요약해서 볼 수 있다.

데이터의 정보를 간략하게 확인하는 것은 여기까지하고 pandas의 기초를 익혀보려고한다.

### pandas 기초

pandas의 자료구조는 Series와 Dataframe으로 구분된다.  
Series은 인덱스와 함께 한개의 리스트만을 갖는 1차원배열이라고 할 수 있는데 Dataframe은 이러한 형태가 2차원으로 확정된 것이라고 이해할 수 있다.   
<br>
*numpy와 pandas는 데이터를 다루는 특성상 자주 같이 사용된다.*

**Series만들기**

In [8]:
import numpy as np

s=pd.Series([1,2,3,np.nan,5,6])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
5    6.0
dtype: float64

중간에 nan값을 넣었는데 데이터과학에서는 관측되지 않은 값, 기록되지않은 값들이 nan값으로 표현되고 이를 결측값이라고 하며 이러한 값을 제대로 다루는 것이 중요하다.

**DataFrame만들기**

In [9]:
#이 글을 작성한 날로 부터 1주일
dates=pd.date_range('20221031',periods=7)
dates

DatetimeIndex(['2022-10-31', '2022-11-01', '2022-11-02', '2022-11-03',
               '2022-11-04', '2022-11-05', '2022-11-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df=pd.DataFrame(np.random.rand(7,4),index=dates,columns=['A','B','C','D'])
df

                   A         B         C         D
2022-10-31  0.662270  0.141454  0.504938  0.968030
2022-11-01  0.556862  0.586014  0.470115  0.889969
2022-11-02  0.187450  0.712531  0.741475  0.470349
2022-11-03  0.053511  0.572602  0.254384  0.113413
2022-11-04  0.506373  0.898537  0.986131  0.240783
2022-11-05  0.534188  0.008911  0.587998  0.638417
2022-11-06  0.335461  0.437837  0.821397  0.308997

**DataFrame다루기**

In [11]:
df.index

DatetimeIndex(['2022-10-31', '2022-11-01', '2022-11-02', '2022-11-03',
               '2022-11-04', '2022-11-05', '2022-11-06'],
              dtype='datetime64[ns]', freq='D')

값만 확인하고 싶다면 values를 사용한다.

In [12]:
df.values

array([[0.66227036, 0.14145449, 0.50493845, 0.96802976],
       [0.556862  , 0.58601403, 0.4701152 , 0.88996873],
       [0.18745032, 0.71253144, 0.7414749 , 0.47034852],
       [0.05351142, 0.5726018 , 0.25438354, 0.11341325],
       [0.50637329, 0.8985373 , 0.98613145, 0.24078288],
       [0.53418848, 0.00891148, 0.58799835, 0.63841704],
       [0.33546127, 0.43783658, 0.8213969 , 0.30899667]])

info()를 사용하여 DataFrame의 개요를 간단하게 확인할 수 있다.  
A,B,C,D열 에 해당하는 값들의 자료형은 float64임을 알 수 있다.

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 7 entries, 2022-10-31 to 2022-11-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       7 non-null      float64
 1   B       7 non-null      float64
 2   C       7 non-null      float64
 3   D       7 non-null      float64
dtypes: float64(4)
memory usage: 280.0 bytes

특정 열의 값을 기준으로 정렬하고 싶다면 sort_values를 사용

In [14]:
#ascending=False라면 내림차순
df.sort_values(by='A',ascending=False)

                   A         B         C         D
2022-10-31  0.662270  0.141454  0.504938  0.968030
2022-11-01  0.556862  0.586014  0.470115  0.889969
2022-11-05  0.534188  0.008911  0.587998  0.638417
2022-11-04  0.506373  0.898537  0.986131  0.240783
2022-11-06  0.335461  0.437837  0.821397  0.308997
2022-11-02  0.187450  0.712531  0.741475  0.470349
2022-11-03  0.053511  0.572602  0.254384  0.113413

In [15]:
df[0:2]

                   A         B         C         D
2022-10-31  0.662270  0.141454  0.504938  0.968030
2022-11-01  0.556862  0.586014  0.470115  0.889969

B,C의 모든 행을 보려고 할 때 아래와 같이 작성가능하다

In [16]:
df.loc[:,['B','C']]

                   B         C
2022-10-31  0.141454  0.504938
2022-11-01  0.586014  0.470115
2022-11-02  0.712531  0.741475
2022-11-03  0.572602  0.254384
2022-11-04  0.898537  0.986131
2022-11-05  0.008911  0.587998
2022-11-06  0.437837  0.821397

In [17]:
df.iloc[1]

A    0.556862
B    0.586014
C    0.470115
D    0.889969
Name: 2022-11-01 00:00:00, dtype: float64

특정 조건을 만족하는 데이터만 얻기
Acolumn에서 0.5이상인 행만 도출

In [18]:
df[df.A>=0.5]

                   A         B         C         D
2022-10-31  0.662270  0.141454  0.504938  0.968030
2022-11-01  0.556862  0.586014  0.470115  0.889969
2022-11-04  0.506373  0.898537  0.986131  0.240783
2022-11-05  0.534188  0.008911  0.587998  0.638417

전체를 기준으로 잡는다면 0.5미만인 값들은 NaN처리

In [19]:
df1=(df[df>=0.5])

In [20]:
df1

                   A         B         C         D
2022-10-31  0.662270       NaN  0.504938  0.968030
2022-11-01  0.556862  0.586014       NaN  0.889969
2022-11-02       NaN  0.712531  0.741475       NaN
2022-11-03       NaN  0.572602       NaN       NaN
2022-11-04  0.506373  0.898537  0.986131       NaN
2022-11-05  0.534188       NaN  0.587998  0.638417
2022-11-06       NaN       NaN  0.821397       NaN

원본데이터에 지장을 줄 수 있기 때문에 따로 데이터를 만들고 NaN값처리에 대해 알아보려고한다.  
<br>
fillna(특정값)←NaN값을 특정값으로 채운다.

In [21]:
df1.fillna(0)

                   A         B         C         D
2022-10-31  0.662270  0.000000  0.504938  0.968030
2022-11-01  0.556862  0.586014  0.000000  0.889969
2022-11-02  0.000000  0.712531  0.741475  0.000000
2022-11-03  0.000000  0.572602  0.000000  0.000000
2022-11-04  0.506373  0.898537  0.986131  0.000000
2022-11-05  0.534188  0.000000  0.587998  0.638417
2022-11-06  0.000000  0.000000  0.821397  0.000000

결측값 앞방향 or 뒷방향으로 채우기

In [22]:
#앞방향
df1.fillna(method='ffill')

                   A         B         C         D
2022-10-31  0.662270       NaN  0.504938  0.968030
2022-11-01  0.556862  0.586014  0.504938  0.889969
2022-11-02  0.556862  0.712531  0.741475  0.889969
2022-11-03  0.556862  0.572602  0.741475  0.889969
2022-11-04  0.506373  0.898537  0.986131  0.889969
2022-11-05  0.534188  0.898537  0.587998  0.638417
2022-11-06  0.534188  0.898537  0.821397  0.638417

In [23]:
#뒷방향
df1.fillna(method='bfill')

                   A         B         C         D
2022-10-31  0.662270  0.586014  0.504938  0.968030
2022-11-01  0.556862  0.586014  0.741475  0.889969
2022-11-02  0.506373  0.712531  0.741475  0.638417
2022-11-03  0.506373  0.572602  0.986131  0.638417
2022-11-04  0.506373  0.898537  0.986131  0.638417
2022-11-05  0.534188       NaN  0.587998  0.638417
2022-11-06       NaN       NaN  0.821397       NaN

In [24]:
#변수별 평균으로 채우기 
df1=df1.fillna(df1.mean())
df1

                   A         B         C         D
2022-10-31  0.662270  0.692421  0.504938  0.968030
2022-11-01  0.556862  0.586014  0.728388  0.889969
2022-11-02  0.564924  0.712531  0.741475  0.832139
2022-11-03  0.564924  0.572602  0.728388  0.832139
2022-11-04  0.506373  0.898537  0.986131  0.832139
2022-11-05  0.534188  0.692421  0.587998  0.638417
2022-11-06  0.564924  0.692421  0.821397  0.832139

**new column 추가하기**

In [25]:
df1['E']=['one','two','three','four','five','six','seven']

In [26]:
df1

                   A         B         C         D      E
2022-10-31  0.662270  0.692421  0.504938  0.968030    one
2022-11-01  0.556862  0.586014  0.728388  0.889969    two
2022-11-02  0.564924  0.712531  0.741475  0.832139  three
2022-11-03  0.564924  0.572602  0.728388  0.832139   four
2022-11-04  0.506373  0.898537  0.986131  0.832139   five
2022-11-05  0.534188  0.692421  0.587998  0.638417    six
2022-11-06  0.564924  0.692421  0.821397  0.832139  seven

**열에 대한 조건걸기**

In [30]:
df1['E'].isin(['two','four','six'])

2022-10-31    False
2022-11-01     True
2022-11-02    False
2022-11-03     True
2022-11-04    False
2022-11-05     True
2022-11-06    False
Freq: D, Name: E, dtype: bool

In [31]:
df1[df1['E'].isin(['two','four','six'])]

                   A         B         C         D     E
2022-11-01  0.556862  0.586014  0.728388  0.889969   two
2022-11-03  0.564924  0.572602  0.728388  0.832139  four
2022-11-05  0.534188  0.692421  0.587998  0.638417   six

**사용하지않는 열 버리기**

In [45]:
df1.drop(['E'], axis=1,inplace=True)

In [46]:
df1

                   A         B         C         D
2022-10-31  0.662270  0.692421  0.504938  0.968030
2022-11-01  0.556862  0.586014  0.728388  0.889969
2022-11-02  0.564924  0.712531  0.741475  0.832139
2022-11-03  0.564924  0.572602  0.728388  0.832139
2022-11-04  0.506373  0.898537  0.986131  0.832139
2022-11-05  0.534188  0.692421  0.587998  0.638417
2022-11-06  0.564924  0.692421  0.821397  0.832139

### DataFrame 병합

In [50]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']},
                index=[0,1,2,3])

df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                  'B':['B4','B5','B6','B7'],
                  'C':['C4','C5','C6','C7'],
                  'D':['D4','D5','D6','D7']},
                index=[4,5,6,7])

df3=pd.DataFrame({'A':['A8','A9','A10','A11'],
                  'B':['B8','B9','B10','B11'],
                  'C':['C8','C9','C10','C11'],
                  'D':['D8','D9','D10','D11']},
                index=[8,9,10,11])

In [51]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [52]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [53]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

데이터 열방향으로 합치기

In [55]:
res=pd.concat([df1,df2,df3])
res

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [56]:
res=pd.concat([df1,df2,df3],keys=['x','y','z'])
res

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

가로로 합치기

In [60]:
df4=pd.DataFrame({'B':['B2','B3','B6','B7'],
                  'D':['D2','D3','D6','D7'],
                  'E':['E2','E3','E6','E7']},
                  index=[2,3,6,7])

res=pd.concat([df1,df4],axis=1)
res

     A    B    C    D    B    D    E
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   E2
3   A3   B3   C3   D3   B3   D3   E3
6  NaN  NaN  NaN  NaN   B6   D6   E6
7  NaN  NaN  NaN  NaN   B7   D7   E7

공통된 인덱스만 합치고 버리기

In [61]:
res=pd.concat([df1,df4],axis=1,join='inner')
res

    A   B   C   D   B   D   E
2  A2  B2  C2  D2  B2  D2  E2
3  A3  B3  C3  D3  B3  D3  E3

In [62]:
left=pd.DataFrame({'key':[0,1],
                  '이름':['A','B']})
right=pd.DataFrame({'key':[0,1],
                   '나이':[19,20]})

In [63]:
left

   key 이름
0    0  A
1    1  B

In [64]:
right

   key  나이
0    0  19
1    1  20

공통된 column으로 합치기

In [65]:
pd.merge(left,right,on='key')

   key 이름  나이
0    0  A  19
1    1  B  20